{"title": "Broiled Tilapia with Thai Coconut Curry Sauce","body": "1 tsp dark sesame oil, divided. 1 tbsp minced peeled fresh ginger. 4 garlic cloves, minced. 1 cup finely chopped red bell pepper. 1 cup chopped scallions. 1 tsp curry powder. 2 tsp red curry paste. 1/2 tsp ground cumin. 4 tsp low-sodium soy sauce, use tamari for gluten-free. 1 tbsp brown sugar. 2 tsp Asian fish sauce. 1 14-ounce can light coconut milk. 1/4 cup chopped fresh cilantro. 6 6-ounce tilapia fillets. salt. Cooking spray"}
{"title": "Whole Wheat Irish Soda Bread Muffins", "body": "baking spray. 1 cup white whole wheat flour. 1 cup unbleached all-purpose flour. 1/2 tsp baking powder. 1/2 tsp baking soda. 1/2 tsp kosher salt. 3 tbsp chilled butter. 1 cup 1% buttermilk. 3 tbsp honey or agave. 1 large egg, beaten. 3 oz raisins, about 2/3 cup"}
{"title": "Creamy Shrimp and Celery Salad","body": "16 ounces large cooked peeled and deveined shrimp. 2 medium cucumbers, peeled and sliced. 1 large celery stalk, sliced thin. 1/4 cup low fat sour cream, regular for Keto. 2 tbsp lite mayonnaise, regular for Keto. 2 tbsp lime juice. 1 tsp Old Bay seasoning. salt to taste. chopped dill, optional for garnish"}
{"title": "Chorizo Breakfast Bowls","body": "12 (1 lb) baby gold or red potatoes, quartered. 3 teaspoons olive oil. 3/4 teaspoon salt. 1/2 teaspoon garlic powder. fresh black pepper, to taste. olive oil spray. 1-1/3 cups cooked turkey chorizo, heated through. 8 large eggs. kosher salt. 2 tbsp crumbled Mexican cheese, queso blanco, queso fresco. 4 ounces sliced avocado, from 1 small haas. cilantro or scallions, for garnish. Cholula hot sauce, for serving"}
{"title": "Spring Asparagus Risotto","body": "4 1/2 cups low-sodium chicken or vegetable broth. 2 tsp olive oil. 1/3 cup shallots, chopped. 1 cup arborio rice. 2 oz dry white wine. 3/4 lb thin asparagus spears, tough ends trimmed, cut 2-inches long. 1-2 tsp fresh lemon juice. 1/4 cup chopped fresh parsley. 1/4 cup freshly grated Parmigiano-Reggiano, plus more for serving. salt and fresh cracked pepper, to taste. 1 tsp grated lemon zest for garnish"}
{"title": "Cod Fish Tacos","body": "4 pieces 4 oz each skinless firm white fish such as cod, (or snapper fillet, mahi mahi), fresh is best, if frozen thawed. 1/2 teaspoon cumin. 1/2 teaspoons kosher salt. 3/4 teaspoons lime chili seasoning, such as Tajin Classic. 1/4 cup fat free Greek Yogurt. 3 tablespoons light mayonnaise. 1 tablespoon lime juice. 1-2 tablespoons water, to thin. 3/4 teaspoon chili-lime seasoning salt, such as Tajin Classic. 1/8 teaspoon kosher salt. 1/4 cup chopped cilantro. 1 cup white cabbage, sliced. 1 cup red cabbage, sliced. 1/4 cup shredded carrots. 1 tablespoon olive oil. 1 tablespoon lime juice. 1/4 teaspoon kosher salt. 8 corn tortillas, charred on the open flame 30 seconds on each side. lime wedges, for serving"}
{"title": "Air Fryer Falafel","body": "1 (15.5 ounce) can chickpeas, rinsed and drained. 1 small yellow onion, quartered. 3 cloves garlic, roughly chopped. 1/3 cup roughly chopped parsley. 1/3 cup roughly chopped cilantro. 1/3 cup chopped scallions. 1 teaspoon cumin. 1/2 teaspoon kosher salt. 1/8 teaspoon crushed red pepper flakes. 1 teaspoon baking powder. 4 tablespoons all purpose flour, plus more for dusting. olive oil spray. hummus, sliced tomatoes, sliced cucumber, thinly sliced red onion, pita, tahini, etc"}